app/Controllers/Orang.php

    public function index()
    {
        $currentpage = $this->request->getVar('page_orang') ? $this->request->getVar('page_orang') : 1;
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $orang = $this->orangModel->search($keyword);
        } else {
            $orang = $this->orangModel;
        }
        $data = [
            'tittle' => 'Daftar Orang',
            'orang' => $orang->paginate(10, 'orang'),
            'pager' => $this->orangModel->pager,
            'currentpage' => $currentpage
        ];
---
SELECT *
FROM `orang`
 LIMIT 90, 10
SELECT COUNT(*) AS `numrows`
FROM `orang`
SELECT *
FROM `orang`
 LIMIT 10